<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"40a63ebe0027f96519f0a35572512d92adfc86454ec4ed2156eed2e480ccac07","plan_job_ref":"Job Create terraform plan #9 at https://github.com/Toxma/SDV-IAC-AWS/actions/runs/13833271519","plan_out_hash":"9b50d08baa51d3a437fc30fed5f9eef696beeaed95067f9f3cd20c4d563cfa8d","plan_hash":"9158f12219f8568e0c11eaf6ab1f24ec9b7acdc2e674e814c80adff54ca3aabc","plan_text_format":"diff-trunc","version":"1.47.0"} -->
Terraform plan in __phase6-7/terraform__
<details>
<summary>Plan: 47 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.dev_to_cpu will be created
+   resource "aws_appautoscaling_policy" "dev_to_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "dev-to-cpu"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***************************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in = false
+           target_value     = 60

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_target.dev_to_target will be created
+   resource "aws_appautoscaling_target" "dev_to_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "***************************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }

+       suspended_state (known after apply)
    }

  # aws_ecs_cluster.ecs-cluster will be created
+   resource "aws_ecs_cluster" "ecs-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "example-university-prod-ecs"
+       tags_all = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }

+       setting (known after apply)
    }

  # aws_ecs_service.app-service will be created
+   resource "aws_ecs_service" "app-service" {
+       availability_zone_rebalancing      = "DISABLED"
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "example-university-prod-app"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "example-university-prod-app"
+           container_port   = 80
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.app-task will be created
+   resource "aws_ecs_task_definition" "app-task" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "1024"
+       enable_fault_injection   = (known after apply)
+       execution_role_arn       = (known after apply)
+       family                   = "example-university-prod-app"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       track_latest             = false
    }

  # aws_iam_policy.cloudwatch_logs_policy will be created
+   resource "aws_iam_policy" "cloudwatch_logs_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy to allow ECS tasks to create and write to CloudWatch log groups"
+       id               = (known after apply)
+       name             = "example-university-prod-CloudWatchLogsPolicy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:CreateLogGroup",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:logs:*:*:*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
    }

  # aws_iam_policy_attachment.cloudwatch_logs_policy_attachment will be created
+   resource "aws_iam_policy_attachment" "cloudwatch_logs_policy_attachment" {
+       id         = (known after apply)
+       name       = "example-university-prod-AttachCloudWatchLogsPolicy"
+       policy_arn = (known after apply)
+       roles      = [
+           "example-university-prod-ecsTaskExecutionRole",
        ]
    }

  # aws_iam_role.ecs_task_execution_role will be created
+   resource "aws_iam_role" "ecs_task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "example-university-prod-ecsTaskExecutionRole"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy.ecs_secrets_access will be created
+   resource "aws_iam_role_policy" "ecs_secrets_access" {
+       id          = (known after apply)
+       name        = "ecs-secrets-access"
+       name_prefix = (known after apply)
+       policy      = (known after apply)
+       role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "example-university-prod-ecsTaskExecutionRole"
    }

  # aws_lb.alb will be created
+   resource "aws_lb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enable_zonal_shift                                           = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "example-university-prod-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags_all                                                     = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # aws_lb_listener.app_listener will be created
+   resource "aws_lb_listener" "app_listener" {
+       arn                                                                   = (known after apply)
+       id                                                                    = (known after apply)
+       load_balancer_arn                                                     = (known after apply)
+       port                                                                  = 80
+       protocol                                                              = "HTTP"
+       routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
+       routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
+       routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
+       routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
+       routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
+       routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
+       routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
+       routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
+       routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
+       routing_http_response_access_control_allow_headers_header_value       = (known after apply)
+       routing_http_response_access_control_allow_methods_header_value       = (known after apply)
+       routing_http_response_access_control_allow_origin_header_value        = (known after apply)
+       routing_http_response_access_control_expose_headers_header_value      = (known after apply)
+       routing_http_response_access_control_max_age_header_value             = (known after apply)
+       routing_http_response_content_security_policy_header_value            = (known after apply)
+       routing_http_response_server_enabled                                  = (known after apply)
+       routing_http_response_strict_transport_security_header_value          = (known after apply)
+       routing_http_response_x_content_type_options_header_value             = (known after apply)
+       routing_http_response_x_frame_options_header_value                    = (known after apply)
+       ssl_policy                                                            = (known after apply)
+       tags_all                                                              = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       tcp_idle_timeout_seconds                                              = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }

+       mutual_authentication (known after apply)
    }

  # aws_lb_target_group.app_tg will be created
+   resource "aws_lb_target_group" "app_tg" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "example-university-prod-tg-wp"
+       name_prefix                        = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = "200"
+           path                = "/"
+           port                = "80"
+           protocol            = "HTTP"
+           timeout             = (known after apply)
+           unhealthy_threshold = 3
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_group_health (known after apply)

+       target_health_state (known after apply)
    }

  # aws_security_group.alb_sg will be created
+   resource "aws_security_group" "alb_sg" {
+       arn                    = (known after apply)
+       description            = "Allow incoming traffic"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "example-university-prod-lb-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_access_sg will be created
+   resource "aws_security_group" "ecs_access_sg" {
+       arn                    = (known after apply)
+       description            = "Security group to allow ECS access to RDS"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 3306
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "example-university-prod-ecs-access-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.service_security_group will be created
+   resource "aws_security_group" "service_security_group" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "example-university-prod-ecs-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
+   resource "aws_db_subnet_group" "database" {
+       arn                     = (known after apply)
+       description             = "Database subnet group for example-university-prod-vpc"
+       id                      = (known after apply)
+       name                    = "example-university-prod-vpc"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Name" = "example-university-prod-vpc"
        }
+       tags_all                = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc"
+           "Project"     = "example-university"
        }
+       vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name" = "example-university-prod-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-default"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
#            (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "example-university-prod-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-default"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "example-university-prod-vpc-default"
        }
+       tags_all               = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-default"
+           "Project"     = "example-university"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "example-university-prod-vpc-us-east-1a"
        }
+       tags_all             = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-us-east-1a"
+           "Project"     = "example-university"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name" = "example-university-prod-vpc-us-east-1b"
        }
+       tags_all             = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-us-east-1b"
+           "Project"     = "example-university"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "example-university-prod-vpc"
        }
+       tags_all = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc"
+           "Project"     = "example-university"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "example-university-prod-vpc-us-east-1a"
        }
+       tags_all                           = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-us-east-1a"
+           "Project"     = "example-university"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "example-university-prod-vpc-us-east-1b"
        }
+       tags_all                           = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-us-east-1b"
+           "Project"     = "example-university"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "example-university-prod-vpc-private-us-east-1a"
        }
+       tags_all         = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-private-us-east-1a"
+           "Project"     = "example-university"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "example-university-prod-vpc-private-us-east-1b"
        }
+       tags_all         = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-private-us-east-1b"
+           "Project"     = "example-university"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "example-university-prod-vpc-public"
        }
+       tags_all         = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-public"
+           "Project"     = "example-university"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.50.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-db-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-db-us-east-1a"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.51.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-db-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-db-us-east-1b"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-private-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-private-us-east-1a"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-private-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-private-us-east-1b"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.101.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-public-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-public-us-east-1a"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.102.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-university-prod-vpc-public-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc-public-us-east-1b"
+           "Project"     = "example-university"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "example-university-prod-vpc"
        }
+       tags_all                             = {
+           "Environment" = "prod"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "example-university-prod-vpc"
+           "Project"     = "example-university"
        }
    }

  # module.aurora_mysql.module.db_instance.aws_db_instance.this[0] will be created
+   resource "aws_db_instance" "this" {
+       address                               = (known after apply)
+       allocated_storage                     = 5
+       allow_major_version_upgrade           = false
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "students"
+       db_subnet_group_name                  = "example-university-prod-vpc"
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       deletion_protection                   = false
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "8.0"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_database_authentication_enabled   = false
+       id                                    = (known after apply)
+       identifier                            = "example-university-prod-mysql"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.small"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create terraform plan #9](https://github.com/Toxma/SDV-IAC-AWS/actions/runs/13833271519)